report draft updated
